content/post/software-engineering.md
+++
title = "Software Engineering"
author = ["Rafael Nicdao"]
tags = ["software engineering"]
draft = false
date = 2021-07-19
pin = true
summary = "Thoughts, observations and realizations accumulated throughout my career"
+++

## Efficiency as a Software Engineer {#efficiency-as-a-software-engineer}


### Decide which decisions are worth making {#decide-which-decisions-are-worth-making}

Know which decisions are important and which ones are not. Don't get bogged down by the unimportant ones.


### Recognizing and Avoiding Accidental Complexity {#recognizing-and-avoiding-accidental-complexity}


#### Writing Comprehensive Documentation {#writing-comprehensive-documentation}

-   Complex things/designs/etc tend to be difficult to explain concisely. Note that of course, there exceptions.


### Defining done realistically {#defining-done-realistically}


#### Pareto Principle -&gt; Recognizing the 80% and deferring the 20% {#pareto-principle-recognizing-the-80-and-deferring-the-20}


### Narrowing down the problem {#narrowing-down-the-problem}


## Architecture Learnings {#architecture-learnings}


### Error Handling {#error-handling}

-   For customer-facing apps, you don't want to show cryptic, technical errors. You know best how to translate technical errors -&gt; user errors, so it might make sense to translate each possible into a dev error vs a user error.
